arnautoff1/esp32-h2-zigbee-window/esp32-h2-zigbee-window/sdkconfig.defaults
# Конфигурация для ESP32-H2 с ZigBee

# Настройки для целевой платформы ESP32-H2
CONFIG_IDF_TARGET="esp32h2"
CONFIG_IDF_TARGET_ESP32H2=y
CONFIG_IDF_TARGET_ARCH_RISCV=y

# Настройки ZigBee
CONFIG_ZB_ENABLED=y
CONFIG_ESP_ZB_PRIMARY_CHANNEL_MASK=0x7fff800
CONFIG_ESP_ZB_TX_POWER=20
CONFIG_ESP_ZB_RX_ON_WHEN_IDLE=y
CONFIG_ESP_ZB_FACTORY_RESET_ERASE_NETWORK_ONLY=y

# Включаем протокол 802.15.4
CONFIG_IEEE802154_ENABLED=y

# Настройки задач RTOS
CONFIG_FREERTOS_HZ=1000

# Настройки сна и энергосбережения
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y

# Настройки для сервоприводов
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

# Настройки памяти
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Настройки логирования
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Настройки NVS
CONFIG_NVS_ENCRYPTION=y 